import streamlit as st
import plotly.graph_objects as go
from urllib.parse import quote
import webbrowser
import os

st.set_page_config(page_title="波士顿凯尔特人队介绍", layout="wide")

st.image("图片/上标.png", width=2000)

# 创建标签页
tabs = st.tabs(["基本信息", "球队数据", "球员阵容", "赛程安排"])

# 基本信息标签页内容
with tabs[0]:
    team_intro = """
    波士顿凯尔特人队（英文名Boston Celtics）于1946年成立，1949年成为美国男篮职业联赛（NBA）创始球队之一。球队作为东部联盟大西洋赛区参加美国职业篮球联赛的比赛。

    目前波士顿凯尔特人队与洛杉矶湖人队同为17座NBA总冠军奖杯的球队，也是NBA史上夺冠次数最多的球队，黄绿大战又以拉里·伯德与“魔术师”约翰逊的交锋堪称经典。凯尔特人也称为“绿军”。1950到1966年，“红衣主教”奥尔巴赫铸造了凯尔特人王朝，率领球队夺得9次总冠军，当中连续八次夺冠。成为总经理后，奥尔巴赫仍然为球队做出最大的贡献，打造约翰·哈夫利切克、乔·怀特、拉里·伯德等潜力球员，帮助球队在70年代和80年代夺得7个总冠军。

    2007年丹尼·安吉成为凯尔特人总经理，打造“三巨头”保罗·皮尔斯、凯文·加内特以及雷·阿伦，07-08赛季总决赛击败宿敌洛杉矶湖人队，夺得队史第17座NBA总冠军奖杯。

    2016年选秀中探花签选中杰伦·布朗，2017年选中探花签选中杰森·塔图姆，安吉经理打造一对年轻核心组合。2019-20赛季东部决赛遗憾不敌迈阿密热火队。
    
    
    """

    st.write("球队信息")
    st.write(team_intro)

# 球队历史标签页内容
with tabs[1]:
    # 定义数据
    labels = ['得分：120.7', '篮板：43.4', '助攻：25.5', '抢断：7.5', '盖帽：5.3', '投篮命中率：46.0', '三分命中率：37.6',
              '失分：110.8']
    values = [120.7, 43.4, 25.5, 7.5, 5.3, 46.0, 37.6, 110.8]
    rankings = ['联盟第3', '联盟第17', '联盟第17', '联盟第21', '联盟第13', '联盟第18', '联盟第8', '联盟第8']

    # 创建雷达图
    fig = go.Figure(data=[go.Scatterpolar(
        r=values,
        theta=labels,
        fill='toself',
        name='球队数据'
    )])

    # 设置雷达图的样式
    fig.update_layout(
        polar=dict(
            radialaxis=dict(visible=True)
        ),
        showlegend=True,
        title_text="球队场均数据"
    )

    # 在 Streamlit 中显示雷达图
    st.plotly_chart(fig)

    # 在雷达图旁边显示数据和排名
    st.write("### 球队场均数据统计")
    for label, value, ranking in zip(labels, values, rankings):
        st.write(f"{label}\n{ranking}")

# 球员阵容标签页内容
with tabs[2]:
    # 假设您已经有一个包含所有球衣图片的列表
    jersey_images = [
        "图片\塔图姆.png", "图片\布朗.png", "图片\霍福德.png", "图片\斯普林格.png", "图片\普里查德.png",
        "图片\怀特.png",
        "图片\豪瑟.png", "图片\米哈伊柳克.png", "图片\波尔津吉斯.png", "图片\戴维森.png", "图片\克塔.png",
        "图片\彼得森.png",
        "图片\霍勒迪.png", "图片\科内特.png", "图片\沃尔什.png", "图片\蒂尔曼.png", "图片\布里塞特.png"
    ]

    # 球员信息
    players = [
        {"number": "0", "position": "前锋", "name": "塔图姆"},  #
        {"number": "7", "position": "后卫", "name": "布朗"},  #
        {"number": "42", "position": "中锋/前锋", "name": "霍福德"},  #
        {"number": "44", "position": "后卫", "name": "斯普林格"},  #
        {"number": "11", "position": "后卫", "name": "普理查德"},  #
        {"number": "9", "position": "后卫", "name": "怀特"},  #
        {"number": "30", "position": "前锋", "name": "豪瑟"},  #
        {"number": "19", "position": "前锋", "name": "米哈伊柳克"},
        {"number": "8", "position": "中锋", "name": "波尔津吉斯"},  #
        {"number": "20", "position": "得分后卫", "name": "戴维森"},  #
        {"number": "88", "position": "中锋", "name": "克塔"},  #
        {"number": "13", "position": "前锋", "name": "彼得森"},  #
        {"number": "4", "position": "组织后卫", "name": "霍乐迪"},  #
        {"number": "40", "position": "中锋", "name": "科内特"},  #
        {"number": "27", "position": "后卫", "name": "沃尔什"},  #
        {"number": "26", "position": "前锋", "name": "蒂尔曼"},  #
        {"number": "12", "position": "前锋", "name": "布里赛特"},
    ]

    # 显示标题
    col1, col2 = st.columns([1, 5])
    with col1:
        st.title("现役球员")
    with col2:
        st.markdown("<br>", unsafe_allow_html=True)
        if st.button("球员总页面"): webbrowser.open('file://' + os.path.abspath("球员\\zhuyemian.html"))

    # 显示球衣
    for i in range(0, len(players), 5):
        cols = st.columns(5)  # 创建5列
        for j in range(5):
            if i + j < len(players):
                player = players[i + j]
                col = cols[j]
                with col:
                    col.image(jersey_images[i + j], width=120)
                    player_info = f"{player['number']} {player['name']} - {player['position']}"
                    # 将球员名字变成一个按钮

                    if st.button(player_info):
                        player_file_path = os.path.join("球员", f"{player['name']}.html")
                        # 打开文件
                        webbrowser.open('file://' + os.path.abspath(player_file_path))

# 赛程安排标签页内容
with tabs[3]:
    data = [
        ["常规赛", "10月26日", "07:00", "尼克斯", "104-108", "凯尔特人"],
        ["常规赛", "10月28日", "07:30", "凯尔特人", "119-111", "热火"],
        ["常规赛", "10月31日", "07:00", "奇才", "107-126", "凯尔特人"],
        ["常规赛", "11月2日", "07:30", "凯尔特人", "155-104", "步行者"],
        ["常规赛", "11月5日", "08:00", "篮网", "114-124", "凯尔特人"],
        ["常规赛", "11月7日", "09:00", "森林狼", "114-109", "凯尔特人"],
        ["常规赛", "11月9日", "08:00", "76人", "106-103", "凯尔特人"],
        ["常规赛", "11月11日", "08:30", "凯尔特人", "121-107", "篮网"],
        ["常规赛", "11月12日", "08:00", "凯尔特人", "117-94", "猛龙"],
        ["常规赛", "11月14日", "08:30", "凯尔特人", "114-98", "尼克斯"],
        ["常规赛", "11月16日", "08:30", "76人", "107-117", "凯尔特人"],
        ["常规赛", "11月18日", "08:30", "猛龙", "105-108", "凯尔特人"],
        ["常规赛", "11月20日", "09:00", "灰熊", "100-102", "凯尔特人"],
        ["常规赛", "11月21日", "08:00", "黄蜂", "121-118", "凯尔特人"],
        ["常规赛", "11月23日", "08:30", "凯尔特人", "119-116", "雄鹿"],
        ["常规赛", "11月25日", "03:30", "魔术", "113-96", "凯尔特人"],
        ["常规赛", "11月27日", "07:00", "凯尔特人", "113-103", "老鹰"],
        ["常规赛", "11月29日", "08:30", "凯尔特人", "124-97", "公牛"],
        ["常规赛", "12月2日", "08:30", "凯尔特人", "125-119", "76人"],
        ["常规赛", "12月5日", "08:30", "步行者", "122-112", "凯尔特人"],
        ["常规赛", "12月9日", "08:30", "凯尔特人", "133-123", "尼克斯"],
        ["常规赛", "12月13日", "08:30", "凯尔特人", "120-113", "骑士"],
        ["常规赛", "12月15日", "08:30", "凯尔特人", "116-107", "骑士"],
        ["常规赛", "12月16日", "08:30", "凯尔特人", "128-111", "魔术"],
        ["常规赛", "12月18日", "04:00", "凯尔特人", "114-97", "魔术"],
        ["常规赛", "12月20日", "11:00", "勇士", "132-126", "凯尔特人"],
        ["常规赛", "12月21日", "11:00", "国王", "119-144", "凯尔特人"],
        ["常规赛", "12月24日", "04:30", "快船", "108-145", "凯尔特人"],
        ["常规赛", "12月26日", "06:00", "湖人", "115-126", "凯尔特人"],
        ["常规赛", "12月29日", "08:30", "凯尔特人", "128-122", "活塞"],
        ["常规赛", "12月30日", "08:30", "凯尔特人", "120-118", "猛龙"],
        ["常规赛", "1月1日", "08:00", "马刺", "101-134", "凯尔特人"],
        ["常规赛", "1月3日", "09:00", "雷霆", "127-123", "凯尔特人"],
        ["常规赛", "1月6日", "08:00", "凯尔特人", "126-97", "爵士"],
        ["常规赛", "1月7日", "08:00", "步行者", "101-118", "凯尔特人"],
        ["常规赛", "1月9日", "08:00", "步行者", "133-131", "凯尔特人"],
        ["常规赛", "1月11日", "08:00", "凯尔特人", "127-120", "森林狼"],
        ["常规赛", "1月12日", "08:30", "雄鹿", "135-102", "凯尔特人"],
        ["常规赛", "1月14日", "08:00", "凯尔特人", "145-113", "火箭"],
        ["常规赛", "1月16日", "08:30", "猛龙", "96-105", "凯尔特人"],
        ["常规赛", "1月18日", "08:30", "凯尔特人", "117-98", "马刺"],
        ["常规赛", "1月20日", "08:30", "凯尔特人", "100-102", "掘金"],
        ["常规赛", "1月22日", "08:00", "火箭", "107-116", "凯尔特人"],
        ["常规赛", "1月23日", "09:30", "独行侠", "110-119", "凯尔特人"],
        ["常规赛", "1月26日", "08:30", "热火", "110-143", "凯尔特人"],
        ["常规赛", "1月28日", "08:00", "凯尔特人", "96-115", "快船"],
        ["常规赛", "1月30日", "08:30", "凯尔特人", "118-112", "鹈鹕"],
        ["常规赛", "1月31日", "08:30", "凯尔特人", "129-124", "步行者"],
        ["常规赛", "2月2日", "08:30", "凯尔特人", "105-114", "湖人"],
        ["常规赛", "2月5日", "07:00", "凯尔特人", "131-91", "灰熊"],
        ["常规赛", "2月8日", "08:30", "凯尔特人", "125-117", "老鹰"],
        ["常规赛", "2月10日", "08:30", "凯尔特人", "133-129", "奇才"],
        ["常规赛", "2月12日", "03:00", "热火", "106-110", "凯尔特人"],
        ["常规赛", "2月14日", "08:30", "篮网", "110-118", "凯尔特人"],
        ["常规赛", "2月15日", "08:30", "凯尔特人", "136-86", "篮网"],
        ["常规赛", "2月23日", "09:00", "公牛", "112-129", "凯尔特人"],
        ["常规赛", "2月25日", "09:30", "尼克斯", "102-116", "凯尔特人"],
        ["常规赛", "2月28日", "08:30", "凯尔特人", "117-99", "76人"],
        ["常规赛", "3月2日", "08:30", "凯尔特人", "138-110", "独行侠"],
        ["常规赛", "3月4日", "04:30", "凯尔特人", "140-88", "勇士"],
        ["常规赛", "3月6日", "08:30", "骑士", "105-104", "凯尔特人"],
        ["常规赛", "3月8日", "11:00", "掘金", "115-109", "凯尔特人"],
        ["常规赛", "3月10日", "09:30", "太阳", "107-117", "凯尔特人"],
        ["常规赛", "3月12日", "10:30", "开拓者", "99-121", "凯尔特人"],
        ["常规赛", "3月13日", "09:00", "爵士", "107-123", "凯尔特人"],
        ["常规赛", "3月15日", "07:30", "凯尔特人", "127-112", "太阳"],
        ["常规赛", "3月18日", "06:00", "奇才", "104-130", "凯尔特人"],
        ["常规赛", "3月19日", "07:30", "凯尔特人", "119-94", "活塞"],
        ["常规赛", "3月21日", "07:30", "凯尔特人", "122-119", "雄鹿"],
        ["常规赛", "3月23日", "07:00", "活塞", "102-129", "凯尔特人"],
        ["常规赛", "3月24日", "08:00", "公牛", "113-124", "凯尔特人"],
        ["常规赛", "3月26日", "07:30", "老鹰", "120-118", "凯尔特人"],
        ["常规赛", "3月29日", "07:30", "老鹰", "123-122", "凯尔特人"],
        ["常规赛", "3月31日", "05:00", "鹈鹕", "92-104", "凯尔特人"],
        ["常规赛", "4月2日", "07:00", "黄蜂", "104-118", "凯尔特人"],
        ["常规赛", "4月4日", "07:30", "凯尔特人", "135-100", "雷霆"],
        ["常规赛", "4月6日", "07:30", "凯尔特人", "101-100", "国王"],
        ["常规赛", "4月8日", "06:00", "凯尔特人", "124-107", "开拓者"],
        ["常规赛", "4月10日", "07:30", "雄鹿", "104-91", "凯尔特人"],
        ["常规赛", "4月12日", "07:30", "凯尔特人", "109-118", "尼克斯"],
        ["常规赛", "4月13日", "07:30", "凯尔特人", "131-98", "黄蜂"],
        ["常规赛", "4月15日", "01:00", "凯尔特人", "132-122", "奇才"],
        ["季后赛", "4月22日", "01:00", "凯尔特人", "114-94", "热火"],
        ["季后赛", "4月25日", "07:00", "凯尔特人", "101-111", "热火"],
        ["季后赛", "4月28日", "06:00", "热火", "84-104", "凯尔特人"],
        ["季后赛", "4月30日", "07:30", "热火", "88-102", "凯尔特人"],
        ["季后赛", "5月2日", "07:30", "凯尔特人", "118-84", "热火"],
        ["季后赛", "5月8日", "07:00", "凯尔特人", "120-95", "骑士"],
        ["季后赛", "5月10日", "07:00", "凯尔特人", "94-118", "骑士"],
        ["季后赛", "5月12日", "08:30", "骑士", "93-106", "凯尔特人"],
        ["季后赛", "5月14日", "07:00", "骑士", "102-109", "凯尔特人"],
        ["季后赛", "5月16日", "07:00", "凯尔特人", "113-98", "骑士"],
        ["季后赛", "5月22日", "08:00", "凯尔特人", "133-128", "步行者"],
        ["季后赛", "5月24日", "08:00", "凯尔特人", "126-110", "步行者"],
        ["季后赛", "5月26日", "08:30", "步行者", "111-114", "凯尔特人"],
        ["季后赛", "5月28日", "08:00", "步行者", "102-105", "凯尔特人"],
        ["季后赛", "6月7日", "08:30", "凯尔特人", "107-89", "独行侠"],
        ["季后赛", "6月10日", "08:00", "凯尔特人", "105-98", "独行侠"],
        ["季后赛", "6月13日", "08:30", "独行侠", "99-106", "凯尔特人"],
        ["季后赛", "6月15日", "08:30", "独行侠", "122-84", "凯尔特人"],
        ["季后赛", "6月18日", "08:30", "凯尔特人", "106-88", "独行侠"],
    ]

    # 自定义表格标题
    st.markdown("## 比赛日程", unsafe_allow_html=True)

    # 创建列标题
    col1, col2, col3, col4, col5, col6, col7, col8, col9 = st.columns(9)
    col1.write("比赛类型")
    col2.write("日期")
    col3.write("时间")
    col4.write("客队")
    col5.write("客队队标")
    col6.write("比分")
    col7.write("主队队标")
    col8.write("主队")
    col9.write("   ")
    index = 0
    # 表格数据
    for row in data:
        index = index + 1
        cols = st.columns(9)
        cols[0].write(row[0])  # 比赛类型
        cols[1].write(row[1])  # 日期
        cols[2].write(row[2])  # 时间
        cols[3].write(row[3])  # 客队
        with cols[4]:
            st.image(f"logo/{row[3]}.png", width=30)  # 客队标志图片
        cols[5].write(row[4])  # 比分
        with cols[6]:
            st.image(f"logo/{row[5]}.png", width=30)  # 主队标志图片
        cols[7].write(row[5])  # 主队

        # 创建“查看详情”按钮
        with cols[8]:  # 详情按钮
            if st.button('查看详情', key=f"{row[0]}_{row[1]}"):
                file_path = f"赛程/{index}-{row[0]}.html"
                webbrowser.open('file://' + os.path.abspath(file_path))

# 显示球队的社交媒体链接
st.subheader("社交媒体")
st.write("[Twitter](https://twitter.com/celtics)")
st.write("[Facebook](https://facebook.com/celtics)")
st.write("[Instagram](https://instagram.com/celtics)")

# streamlit run code.py
